In [5]:
people = {
    "first" : ["Tarokh", "James", "Tommy"],
    "last" : ["Yaghoubi", "Hollands", "White"],
    "email" : ["tarokhgit@gmail.com", "james@gmail.com", "tommy@yahoo.com"]
}

In [7]:
people['first']

['Tarokh', 'James', 'Tommy']

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(people)

In [10]:
df

    first      last                email
0  Tarokh  Yaghoubi  tarokhgit@gmail.com
1   James  Hollands      james@gmail.com
2   Tommy     White      tommy@yahoo.com

In [16]:
df[['first', 'email']]

    first                email
0  Tarokh  tarokhgit@gmail.com
1   James      james@gmail.com
2   Tommy      tommy@yahoo.com

In [12]:
type(df['email'])

pandas.core.series.Series

In [17]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [26]:
df.iloc[[0, 1]]

    first      last                email
0  Tarokh  Yaghoubi  tarokhgit@gmail.com
1   James  Hollands      james@gmail.com

In [23]:
df

    first      last                email
0  Tarokh  Yaghoubi  tarokhgit@gmail.com
1   James  Hollands      james@gmail.com
2   Tommy     White      tommy@yahoo.com

In [31]:
df.loc[[0, 1], ['first', 'email']]

    first                email
0  Tarokh  tarokhgit@gmail.com
1   James      james@gmail.com